[
    {
        "organization": "SpaceX",
        "location": "SLC-4E, Vandenberg SFB, California, USA",
        "datetime": "Fri Jul 12, 2024 02:35 UTC",
        "details": "SpaceX launch of a batch of Starlink v2-mini satellites for their second generation high-speed low earth orbit internet satellite constellation. Mission includes 13 Direct-to-Cell satellites and 7 V2-mini satellites.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Outcome Pending"
    },
    {
        "organization": "iSpace",
        "location": "Site 95A, Jiuquan Satellite Launch Center, China",
        "datetime": "Wed Jul 10, 2024 23:40 UTC",
        "details": "3 weather satellites performing atmospheric measurements using GNSS Radio Occultation for a Tianjin based company. Constellation is planned to have an eventual 90 satellites.",
        "price": "Liftoff Thrust: 557 kN",
        "status": "Status: Active",
        "mission_status": "Failure"
    },
    {
        "organization": "ESA",
        "location": "ELA-4, Guiana Space Centre, French Guiana, France",
        "datetime": "Tue Jul 09, 2024 19:00 UTC",
        "details": "Test re-entry capsule for reentry technologies such as new-generation ablative materials for thermal protection systems for the ArianeGroup.",
        "price": "Price: $88.0 million",
        "status": "Status: Active",
        "mission_status": "Partial Failure"
    },
    {
        "organization": "CASC",
        "location": "LC-9A, Taiyuan Satellite Launch Center, China",
        "datetime": "Thu Jul 04, 2024 22:49 UTC",
        "details": "A pair of satellites officially described as for cartographic surveying purposes, details TBD.",
        "price": "Liftoff Thrust: 7,230 kN",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "Firefly",
        "location": "SLC-2W, Vandenberg SFB, California, USA",
        "datetime": "Thu Jul 04, 2024 04:04 UTC",
        "details": "CatSat is a 6U CubeSat being built and tested by University of Arizona students, faculty, and staff. The satellite will launch atop a Firefly Alpha rocket into a nearly sun-synchronous orbit around the Earth. Thanks to some trickery on behalf of orbital mechanics, this peculiar orbit ensures that the satellite will constantly remain in daylight, maximizing the capabilities of the mission. During the mission’s six-month expected lifetime, CatSat will detect high-frequency signals from HAM radio operators all around the globe with its WSPR antenna, demonstrate an inflatable antenna for high bandwidth transmission, and provide high-resolution imaging of the Earth. The data this satellite provides will give insights into the variation of the ionosphere and the technical capabilities of the new systems being tested.",
        "price": "Price: $15.0 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-40, Cape Canaveral SFS, Florida, USA",
        "datetime": "Mon Jul 08, 2024 23:30 UTC",
        "details": "First communication geostationary satellite built in Turkey. (Some payloads are Canadian) Türksat 6A is a satellite that will provide data relay for civil and military communications to the Anatolian peninsula as well as most of the European continent, the Middle East, and the westernmost part of the Russian federation. The satellite is equipped with 16(+4) Ku-band and 2(+1) X-band transponders. (reserve)",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "CASC",
        "location": "LC-201, Wenchang Space Launch Site, China",
        "datetime": "Sat Jun 29, 2024 11:57 UTC",
        "details": "Chinese communication geostationary satellite for unknown purposes.",
        "price": "Liftoff Thrust: 7,128 kN",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "MHI",
        "location": "LA-Y2, Tanegashima Space Center, Japan",
        "datetime": "Mon Jul 01, 2024 03:06 UTC",
        "details": "The Advanced Land Observing Satellite-4 (ALOS-4) is a satellite to observe the Earth's surface using its onboard phased array type L-band synthetic aperture radar (PALSAR-3). The L-band radar technology has continuously been developed in Japan. With further improved observation performance compared to the predecessor PALSAR-2 aboard the DAICHI-2 (ALOS-2), JAXA and its prime contractor, Mitsubishi Electric Corporation, are developing the satellite aiming at achieving both high resolution and a broader observation swath. Unlike observations by an optical sensor, radar images can be acquired day and night as it does not require sunlight. Moreover, since radio waves can penetrate clouds, the images can be obtained regardless of weather conditions. The ALOS-4 will leverage these merits for observing and monitoring disaster-hit areas, forests, and sea ice. In addition, it will also challenge new areas such as monitoring infrastructure displacement. The ALOS-4 will be equipped with the Automatic Identification System for ships (AIS) receiver, as was DAICHI-2, so that the satellite will also monitor oceans by receiving AIS signals from vessels as well as by acquiring the PALSAR-3 images. The SPace based AIS Experiment (SPAISE3) is a high-performance satellite AIS. Effective countermeasures against radio wave interference regions are taken for the SPAISE3 with multiple antennas and ground-based data processing; therefore, the detection success rate of a ship in the heavy marine traffic areas will be improved compared to DAICHI-2. SPAISE3 development is JAXA's ongoing project in cooperation with NEC Corporation.",
        "price": "Price: $50.0 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-40, Cape Canaveral SFS, Florida, USA",
        "datetime": "Wed Jul 03, 2024 08:55 UTC",
        "details": "SpaceX launch of a batch of Starlink v2-mini satellites for their second generation high-speed low earth orbit internet satellite constellation.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-40, Cape Canaveral SFS, Florida, USA",
        "datetime": "Thu Jun 27, 2024 11:14 UTC",
        "details": "SpaceX launch of a batch of Starlink v2-mini satellites for their second generation high-speed low earth orbit internet satellite constellation.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-4E, Vandenberg SFB, California, USA",
        "datetime": "Sat Jun 29, 2024 03:14 UTC",
        "details": "Second batch of satellites for a reconnaissance satellite constellation built by SpaceX and Northrop Grumman for the National Reconnaissance Office to provide imaging and other reconnaissance capabilities.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "LC-39A, Kennedy Space Center, Florida, USA",
        "datetime": "Tue Jun 25, 2024 21:26 UTC",
        "details": "GOES-U will provide advanced imagery and atmospheric measurements of Earth’s weather, oceans, and environment, as well as real-time mapping of total lightning activity and improved monitoring of solar activity and space weather.",
        "price": "Price: $97.0 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-4E, Vandenberg SFB, California, USA",
        "datetime": "Mon Jun 24, 2024 03:47 UTC",
        "details": "SpaceX launch of a batch of Starlink v2-mini satellites for their second generation high-speed low earth orbit internet satellite constellation. 13 of the 20 satellites included are Direct-to-Cell capable.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-40, Cape Canaveral SFS, Florida, USA",
        "datetime": "Thu Jun 20, 2024 21:35 UTC",
        "details": "ASTRA 1P/SES-24, a classic wide-beam satellite, will support SES’s prime TV neighbourhood and enable content owners, private and public broadcasters across Germany, France and Spain to continue broadcasting satellite TV channels in the highest-picture quality in the most cost-efficient manner. It will be based on the full electric and powerful Spacebus NEO platform developed by Thales Alenia Space and already flight proven in orbit.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "Roscosmos",
        "location": "Site 31/6, Baikonur Cosmodrome, Kazakhstan",
        "datetime": "Thu May 30, 2024 09:42 UTC",
        "details": "Progress (in Russian: \"Прогресс\") MS-27 is a Russian cargo vehicle which will resupply the International Space Station. This will be the 180th flight of a Progress. It was the first cargo to fly in space, and also the first to bring freight back to Earth, thanks to a Raduga capsule. It's a cargo ship developed to supply the Salyut 6 space station, which was subsequently used successively to supply the crews staying on board the Salyut 7, Mir and from the International Space Station. It made its first flight in 1978 and was the first vessel of this type: it enabled the crews to stay in space by bringing consumables (food, water, fuel, oxygen) and spare parts. The Progress spacecraft is largely derived from the Soyuz spacecraft intended for the transport of crews in low orbit. It is launched by a Soyuz rocket lifting off from the Baikonur cosmodrome. It has a mass of around 7 tonnes for a length of 7.9 meters and its carrying capacity is around 2.5 tonnes. It can transport both pressurized freight and gases, propellants and liquids but is not designed to bring freight back to Earth (except with a Raduga capsule). Like the Soyuz spacecraft, it is equipped with a Kours automatic docking system. Several variants of the Progress spacecraft have been developed over the decades with increasing capabilities.",
        "price": "Price: $17.42 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-40, Cape Canaveral SFS, Florida, USA",
        "datetime": "Wed Jun 05, 2024 02:16 UTC",
        "details": "SpaceX launch of a batch of Starlink v2-mini satellites for their second generation high-speed low earth orbit internet satellite constellation. 13 of the 20 satellites included on this mission are Direct-to-Cell equipped.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "Galactic Energy",
        "location": "Site 95A, Jiuquan Satellite Launch Center, China",
        "datetime": "Thu May 30, 2024 23:39 UTC",
        "details": "Carried 5 satellites to orbit: * Jiguang 01 & 02, a pair of inter-satellite laser communication testing satellites * Yunyao-1-14/25/26 GNSS occultation weather satellites",
        "price": "Price: $4.38 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "ULA",
        "location": "SLC-41, Cape Canaveral SFS, Florida, USA",
        "datetime": "Wed Jun 05, 2024 14:52 UTC",
        "details": "Crew test flight of Boeing's Starliner spacecraft as part of NASA's Commercial Crew program. The crew will be NASA astronauts Barry Wilmore and Sunita Williams.",
        "price": "Liftoff Thrust: 7,152 kN",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "CASC",
        "location": "LC-2, Xichang Satellite Launch Center, China",
        "datetime": "Thu May 30, 2024 12:12 UTC",
        "details": "Chinese built geostationary communication satellite for the Pakistan Space and Upper Atmosphere Research Commission (SUPARCO), with 48 C/Ku/Ka/L band transponders for use at 38.2° E.",
        "price": "Price: $29.15 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "CASC",
        "location": "LC-3, Xichang Satellite Launch Center, China",
        "datetime": "Sat Jun 22, 2024 07:00 UTC",
        "details": "The Space Variable Objects Monitor (SVOM) is a French/Chinese planned small X-ray telescope satellite under development by China National Space Administration (CNSA) and the \"Centre National d'Études Spatiales - CNES.\" SVOM will study the explosions of massive stars by analysing the resulting gamma-ray bursts. The lightweight X-ray mirror for SVOM weighs just 1 kg (2.2 lb). SVOM will add new capabilities to the work of finding gamma-ray bursts currently being done by the multinational satellite Swift. Its anti-solar pointing strategy makes the Earth cross the field of view of its payload every orbit.",
        "price": "Price: $30.8 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-40, Cape Canaveral SFS, Florida, USA",
        "datetime": "Sat Jun 01, 2024 02:37 UTC",
        "details": "SpaceX launch of a batch of Starlink v2-mini satellites for their second generation high-speed low earth orbit internet satellite constellation.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-40, Cape Canaveral SFS, Florida, USA",
        "datetime": "Sun Jun 23, 2024 17:15 UTC",
        "details": "SpaceX launch of a batch of Starlink v2-mini satellites for their second generation high-speed low earth orbit internet satellite constellation.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "Galactic Energy",
        "location": "Site 95A, Jiuquan Satellite Launch Center, China",
        "datetime": "Thu Jun 06, 2024 05:00 UTC",
        "details": "Carried 3 satellites to polar orbit, details TBD: * TEE-01B *Naxing-3A/B",
        "price": "Price: $4.38 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "Rocket Lab",
        "location": "Rocket Lab LC-1B, Māhia Peninsula, New Zealand",
        "datetime": "Wed Jun 05, 2024 03:15 UTC",
        "details": "The PREFIRE (Polar Radiant Energy in the Far-InfraRed Experiment) mission will send two CubeSats into space to study how much heat the planet absorbs and emits from its polar regions, including the Arctic and Antarctica. Analysis of PREFIRE measurements will inform climate and ice models, providing better projections of how a warming world will affect sea ice loss, ice sheet melt, and sea level rise. Improving climate models can ultimately help to provide more accurate projections on the impacts of storm severity and frequency, as well as coastal erosion and flooding.",
        "price": "Price: $7.5 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "Orbital Launch Pad A, Starbase, Texas, USA",
        "datetime": "Thu Jun 06, 2024 12:50 UTC",
        "details": "Starship will attempt another flight test to demonstrate orbital launch capability.",
        "price": "Liftoff Thrust: 74,432 kN",
        "status": "Status: Active",
        "mission_status": "Suborbital Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-4E, Vandenberg SFB, California, USA",
        "datetime": "Sat Jun 08, 2024 12:58 UTC",
        "details": "SpaceX launch of a batch of Starlink v2-mini satellites for their second generation high-speed low earth orbit internet satellite constellation.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-40, Cape Canaveral SFS, Florida, USA",
        "datetime": "Sat Jun 08, 2024 01:56 UTC",
        "details": "SpaceX launch of a batch of Starlink v2-mini satellites for their second generation high-speed low earth orbit internet satellite constellation.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "Rocket Lab",
        "location": "Rocket Lab LC-1B, Māhia Peninsula, New Zealand",
        "datetime": "Thu Jun 20, 2024 18:13 UTC",
        "details": "First batch of five satellites for the French Kinéis IoT constellation designed to operate with 25 nanosatellites of 30 kg each. The constellation will enable Kinéis, a company backed by private and public investors including the French government’s space agency CNES (Centre National d'Études Spatiales) and CLS (Collecte Localisation Satellites) an international space-based solutions provider, to improve its global IoT connectivity.",
        "price": "Price: $7.5 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "SpaceX",
        "location": "SLC-4E, Vandenberg SFB, California, USA",
        "datetime": "Wed Jun 19, 2024 03:40 UTC",
        "details": "SpaceX launch of a batch of Starlink v2-mini satellites for their second generation high-speed low earth orbit internet satellite constellation. 13 of the 20 satellites launching on this mission have Direct to Cell capabilities.",
        "price": "Price: $69.75 million",
        "status": "Status: Active",
        "mission_status": "Success"
    },
    {
        "organization": "Virgin Galactic",
        "location": "VMS Eve, Spaceport America, New Mexico, USA",
        "datetime": "Sat Jun 08, 2024 15:26 UTC",
        "details": "The Galactic 07 mission will be Virgin Galactic's eleventh manned spaceflight and SpaceShipTwo's seventh commercial mission. The commercial crew on this mission is composed of a researcher affiliated with Axiom Space, two private Americans, and a private Italian. The Virgin Galactic crew on Unity will be Commander Nicola Pecile and pilot Jameel Janjua. The ‘Galactic 07’ autonomous rack-mounted research payloads will include a Purdue University experiment designed to study propellant slosh in fuel tanks of maneuvering spacecraft, as well as a UC Berkeley payload testing a new type of 3D printing.",
        "price": "Payload to LEO: 0 kg",
        "status": "Status: Retired",
        "mission_status": "Suborbital Success"
    }
]